# Lecture 19
In this example, we will use **SQL** to query a database of routes, airlines, and airports.

In [1]:
# Load libraries
import sqlite3
import pandas as pd

In [2]:
# Connect to database
db = sqlite3.connect("lecture_19.db")

In [ ]:
# Show routes table
sql_expr = """
SELECT * FROM routes LIMIT 5;
"""
pd.read_sql(sql_expr, db)

In [ ]:
# Show airlines table
sql_expr = """
SELECT * FROM airlines LIMIT 5;
"""
pd.read_sql(sql_expr, db)

In [ ]:
# Show airports table
sql_expr = """
SELECT * FROM airports LIMIT 5;
"""
pd.read_sql(sql_expr, db)

In [ ]:
# Question 01: What is the northernmost airport in the world?
sql_expr = """
...
"""
pd.read_sql(sql_expr, db)

In [ ]:
# Question 02: What is the lowest airport in the world?
sql_expr = """
...
"""
pd.read_sql(sql_expr, db)

In [3]:
# Question 03: How many routes depart from Chicago?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes' FROM routes
INNER JOIN airports
ON routes.source = airports.code
WHERE airports.city = 'Chicago'
"""
pd.read_sql(sql_expr, db)

   Number of Routes
0               697

In [15]:
# Question 04: How many routes does American Airlines have?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes' FROM routes
INNER JOIN airlines
On routes.airline_id = airlines.id
WHERE airlines.name = 'American Airlines';
"""
pd.read_sql(sql_expr, db)

   Number of Routes
0              2354

In [8]:
# Question 05: How many American Airlines routes arrive to or depart from Chicago?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes' FROM routes
INNER JOIN airports
ON airports.code = routes.source OR airports.code = routes.dest
INNER JOIN airlines
ON routes.airline_id = airlines.id
"""
pd.read_sql(sql_expr, db)

   Number of Routes
0            133521

In [13]:
# Question 06: Which airline has the most routes?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes', airlines.name FROM routes
INNER JOIN airlines
ON airlines.id = routes.airline_id
GROUP BY routes.airline_id
ORDER BY COUNT(*) DESC
LIMIT 1
"""
pd.read_sql(sql_expr, db)

   Number of Routes     name
0              2484  Ryanair

In [18]:
# Question 07: Which city has the most departing routes?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes', airports.city FROM routes
INNER JOIN airports
ON airports.code = routes.source
GROUP BY airports.city
ORDER BY COUNT(*) DESC
LIMIT 1;
"""
pd.read_sql(sql_expr, db)

   Number of Routes    city
0              1232  London

In [21]:
# Question 08: How many international routes are there?
sql_expr = """
SELECT COUNT(*) AS 'Number of Routes' FROM routes
INNER JOIN airports AS airports_source
ON airports_source.code = routes.source
INNER JOIN airports AS airports_dest
ON airports_dest.code = routes.dest
WHERE airports_source.country <> airports_dest.country
"""
pd.read_sql(sql_expr, db)

   Number of Routes
0             34831